return {
    -- 引言
    {
        name = "一切的开头",
        desc = {
            "不知为何来到了这个世界，一些都有些不太一样。不过好在很快就适应了这里，相信一定有什么办法回到我原本的世界。在探索过程中，我还发现一些奇怪的东西。每当夜晚都会出现黑色的身影，它们似乎有着神奇的力量。但是当我伸手时，却又消失不见了。",
            "(一些污损的内容)",
            "这些鬼东西不知道是什么！火柴！我的火柴！！千万不要熄灭火柴！！！",
            "寂静的夜晚令人发狂，我在吃了一些白天收集的烤仙人掌后稍稍能够思考了。我要制作一些“额外物品”来保护自己，来应付接下来可能遇到的事情……",
        },
    },

    -- 武器
    {
        name = "酣战正欢",
        desc = {
            "这片奇艺的世界里，我需要一些武器来保护自己。这里充满了奇怪的物件，正好可以做一些尝试。",

            -- 玉米枪
            {
                type="img",
                name="popcorngun",
                -- atlas="images/inventoryimages/popcorngun.xml",
                -- image="popcorngun.tex",
            },
            "“玉米枪”只需要一些食材就能制作，可以远程攻击，在任何时候都非常好用。",

            -- 鱼刀
            {
                type="img",
                name="aip_fish_sword",
            },
            "用池塘里钓到的鱼制作的“鱼刀”虽然会腐烂，但是在海上却可以一直保持最佳的战斗效果倒也是让人惊喜~",

            -- 蜂语
            {
                type="img",
                name="aip_beehave",
            },
            "在沼泽地有一些奇怪的触手，用它们的触手钉制作的“蜂语”攻击蜂类生物似乎效果很不错。",

            -- 赌徒铠甲
            {
                type="img",
                name="aip_armor_gambler",
            },
            "在这个世界似乎有着奇怪的魔力，当你相信这件“赌徒铠甲”可以躲避致命伤害时，它似乎就有概率生效！",

            -- 诙谐面具
            {
                type="img",
                name="aip_joker_face",
            },
            "用活木制作的“诙谐面具”，总是时不时的会冒出火星并飞向附近的敌人。虽然耐久度不高，但是用活木可以直接修复也还算是耐用了。",
        
             -- 木图腾
            {
                type="img",
                name="woodener",
            },
            "“木图腾”可以存放一些木制品，比如树种、木材、活木什么的。它会每过一段时间就在附近种下树种。同时，它似乎也能将包容之物聚合成一根奇特的船桨。",
            
            -- 树精木浆
            {
                type="img",
                name="aip_oar_woodead",
            },
            "这把“树精木浆”就是那个神奇的船桨，不同于一般的船桨。每次划船反而会让它变得更结实。此外，用它攻击同一个敌人的时候也会越打越疼。真令人吃惊。",
       
            -- 子卿
            {
                type="img",
                name="aip_suwu",
            },
            "千山鸟飞绝，万径人踪灭。这把“子卿”正如其名，在人越少的时候会越强大！当永恒大陆没有其他人的时候，它就是你最强力的依仗。",
        
            
            -- 榴星
            {
                type="img",
                name="aip_oldone_durian",
            },
            "我尝试把“榴莲”和“球茎”结合后，它们产生了神奇的化学反应。可以像“球茎”一样投掷，但是却更耐用。我准备给它其名叫“‘榴’星”",
        },
    },

    -- 甘之如饴
    {
        name = "甘之如饴",
        desc = {
            "在这个世界探险，怎么可以少了我的独家秘方。事实证明无论是哪个世界，花蜜酿造的饮品都不会特别差~",

            -- 酿造桶
            {
                type="img",
                name="aip_nectar_maker",
                scale = 1.5,
            },
            "用一些木材做了一个简单的“花蜜酿造桶”后就可以开始酿造佳酿了。似乎不少东西都可以用来合成，甚至可以把酿造的花蜜继续酿造。不过每次酿造都会略微损失一些效果，也算是种平衡吧。当它过于强力时甚至可以持续恢复生命。我在酿造过程中也摸索出了一些技巧：",
            " - 冰块：食用后会降低体温",
            " - 水果：回复生命、理智、饥饿",
            " - 花蜜：回复生命、理智、饥饿",
            " - 蜂蜜：回复生命、理智、饥饿",
            " - 方糖：提升 1 级品质",
            " - 发光食物：回复理智值并提升移动速度",
            " - 食人花种子：攻击产生吸血效果",
            " - 蜂刺、蜘蛛巢、海象牙：提升攻击伤害",
            " - 粮食：花蜜过期后不会变成腐烂物而会变成酒饮",

            -- 花蜜
            {
                type="img",
                name="aip_nectar_0",
            },
            "“糟糕品质的花蜜”真是我的失败之作。我在制作过程中一定混入了不可食用的恐怖东西！吃下感觉都不健康了。",

            {
                type="img",
                name="aip_nectar_1",
            },
            "人生的第一瓶可以饮用的花蜜往往都是“普通品质的花蜜”。",

            {
                type="img",
                name="aip_nectar_2",
            },
            "“优秀品质的花蜜”需要相当的精力，味道相当不错。",

            {
                type="img",
                name="aip_nectar_3",
            },
            "精益救精的酿造师才能制作出来的“精良品质的花蜜”，这是能力的证明！",

            {
                type="img",
                name="aip_nectar_4",
            },
            "“杰出品质的花蜜”相比饮用更值得收藏！",

            {
                type="img",
                name="aip_nectar_5",
            },
            "世上真的存在“完美品质的花蜜”吗？",

            {
                type="img",
                name="aip_nectar_wine",
            },
            "放了一些粮食的花蜜变质后不但没有腐坏，反而变成了“花蜜酒精饮”。只是喝下后走路有些不太稳当了。",
        },
    },

    -- 生存之道
    {
        name = "生存之道",
        desc = {
            "未雨绸缪总是首选，在战斗之前做一些补给准备会非常有用。",

            -- 酿造桶
            {
                type="img",
                name="aip_nectar_maker",
            },
            "“花蜜酿造桶”做的花蜜饮总是让人“甘之如饴”~",

            -- 血袋
            {
                type="img",
                name="aip_blood_package",
            },
            "“血袋”真是奇怪的东西，在原本的世界可不会因为喝一口它就能恢复健康，而在这里却可以？",

            -- 草木灰
            {
                type="img",
                name="aip_plaster",
            },
            "这里的夏天非常毒辣，在中暑的时候贴上一剂“草木灰”可以立刻缓解症状。",

            -- 古早沙滩壶
            {
                type="img",
                name="aip_olden_tea_half",
            },
            "我在海里捡到的瓶子里发现了这个配方，但是味道并不怎么样。喝下后我似乎就听得懂海里那个大怪物说的话了。",
        },
    },

    -- 鲜花谜团
    {
        name = "鲜花谜团",
        desc = {
            "在这个世界，我偶尔发现了一些奇怪的谜团。解开后似乎有什么魔力进入了我的身体中。在每天日出我都能感到恢复活力！",

            -- 酿造桶
            {
                type="img",
                name="aip_nectar_maker",
            },
            "“花蜜酿造桶”做的花蜜饮总是让人“甘之如饴”~",
        },
    },
}